<a href="https://colab.research.google.com/github/MuhammadHamzaAfzal/Python_Class_Work_jz/blob/master/Pandas_3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Filtering Out Missing Data

In [0]:
import pandas as pd
import numpy as np
from numpy import nan as NA

In [0]:
data = pd.Series([12,NA,89,NA,34,78,NA])
data

0    12.0
1     NaN
2    89.0
3     NaN
4    34.0
5    78.0
6     NaN
dtype: float64

In [0]:
data.dropna()

0    12.0
2    89.0
4    34.0
5    78.0
dtype: float64

In [0]:
data[data.notnull()]

0    12.0
2    89.0
4    34.0
5    78.0
dtype: float64

In [0]:
obj = pd.DataFrame([[1,NA,45,NA],[23,67,NA,89],[12,NA,NA,67],[23,NA,89,87]])

In [0]:
obj

    0     1     2     3
0   1   NaN  45.0   NaN
1  23  67.0   NaN  89.0
2  12   NaN   NaN  67.0
3  23   NaN  89.0  87.0

# Clean

In [0]:
obj.dropna()

Empty DataFrame
Columns: [0, 1, 2, 3]
Index: []

In [0]:
obj.dropna(how = 'all')

    0     1     2     3
0   1   NaN  45.0   NaN
1  23  67.0   NaN  89.0
2  12   NaN   NaN  67.0
3  23   NaN  89.0  87.0

In [0]:
obj.dropna(how='any')

Empty DataFrame
Columns: [0, 1, 2, 3]
Index: []

In [0]:
obj[4] = NA

In [0]:
obj

    0     1     2     3   4
0   1   NaN  45.0   NaN NaN
1  23  67.0   NaN  89.0 NaN
2  12   NaN   NaN  67.0 NaN
3  23   NaN  89.0  87.0 NaN

In [0]:
obj.dropna(axis = 1 , how = 'all')

    0     1     2     3
0   1   NaN  45.0   NaN
1  23  67.0   NaN  89.0
2  12   NaN   NaN  67.0
3  23   NaN  89.0  87.0

In [0]:
obj.dropna(axis = 0 , how = 'any')

Empty DataFrame
Columns: [0, 1, 2, 3, 4]
Index: []

In [0]:
obj.dropna(axis = 0 , how = 'all')

    0     1     2     3   4
0   1   NaN  45.0   NaN NaN
1  23  67.0   NaN  89.0 NaN
2  12   NaN   NaN  67.0 NaN
3  23   NaN  89.0  87.0 NaN

In [0]:
data = pd.DataFrame(np.random.randn(7,3))
data

          0         1         2
0 -0.400935  1.020593  0.822075
1  0.772864 -1.120036  0.526842
2  2.095452 -0.687207 -0.532727
3 -0.466555  0.515515 -0.796311
4 -0.231112 -0.692926 -1.428055
5 -1.530518  0.104650  1.415290
6  0.864643 -0.035089  1.374224

In [0]:
data.iloc[:3,1] = NA

In [0]:
data

          0         1         2
0 -0.400935       NaN  0.822075
1  0.772864       NaN  0.526842
2  2.095452       NaN -0.532727
3 -0.466555  0.515515 -0.796311
4 -0.231112 -0.692926 -1.428055
5 -1.530518  0.104650  1.415290
6  0.864643 -0.035089  1.374224

In [0]:
data.iloc[4:,2] = NA

In [0]:
data

          0         1         2
0 -0.400935       NaN  0.822075
1  0.772864       NaN  0.526842
2  2.095452       NaN -0.532727
3 -0.466555  0.515515 -0.796311
4 -0.231112 -0.692926       NaN
5 -1.530518  0.104650       NaN
6  0.864643 -0.035089       NaN

In [0]:
data.dropna(thresh = 2)

          0         1         2
0 -0.400935       NaN  0.822075
1  0.772864       NaN  0.526842
2  2.095452       NaN -0.532727
3 -0.466555  0.515515 -0.796311
4 -0.231112 -0.692926       NaN
5 -1.530518  0.104650       NaN
6  0.864643 -0.035089       NaN

In [0]:
tr= pd.DataFrame([[1,NA,45,NA,3,7,NA,3,4,6],[1,2,3,4,5,6,7,8,9,0]])

In [0]:
tr.dropna(thresh=8)

   0    1  2    3  4  5    6  7  8  9
1  1  2.0  3  4.0  5  6  7.0  8  9  0

In [0]:
display(tr)

   0    1   2    3  4  5    6  7  8  9
0  1  NaN  45  NaN  3  7  NaN  3  4  6
1  1  2.0   3  4.0  5  6  7.0  8  9  0

In [0]:
data1 = pd.DataFrame(np.random.randn(9,4))
data1

          0         1         2         3
0 -0.427703  0.090139 -0.642435 -2.576884
1 -0.257412 -0.591604 -0.546373  0.235960
2 -1.720986 -1.064990 -0.897181  1.796840
3  0.717568  1.172340 -0.669203  3.064424
4 -0.527157  0.419471 -0.557223 -0.555620
5  0.132113  1.730823  0.709728 -0.143291
6 -0.820846 -0.587280  0.132536 -1.319217
7 -0.811715  1.443096  0.883962  0.425833
8  0.058048  0.405307  1.620708  2.411744

In [0]:
data1.iloc[:5,1]= NA

In [0]:
data1.iloc[3:6 , 3] = NA

In [0]:
data1.iloc[8,3]=NA

In [0]:
data1.iloc[4:6,0]=NA

In [0]:
data1

          0         1         2         3
0 -0.427703       NaN -0.642435 -2.576884
1 -0.257412       NaN -0.546373  0.235960
2 -1.720986       NaN -0.897181  1.796840
3  0.717568       NaN -0.669203       NaN
4       NaN       NaN -0.557223       NaN
5       NaN  1.730823  0.709728       NaN
6 -0.820846 -0.587280  0.132536 -1.319217
7 -0.811715  1.443096  0.883962  0.425833
8  0.058048  0.405307  1.620708       NaN

In [0]:
data1.fillna(method="ffill")

          0         1         2         3
0 -0.427703       NaN -0.642435 -2.576884
1 -0.257412       NaN -0.546373  0.235960
2 -1.720986       NaN -0.897181  1.796840
3  0.717568       NaN -0.669203  1.796840
4  0.717568       NaN -0.557223  1.796840
5  0.717568  1.730823  0.709728  1.796840
6 -0.820846 -0.587280  0.132536 -1.319217
7 -0.811715  1.443096  0.883962  0.425833
8  0.058048  0.405307  1.620708  0.425833

In [0]:
data1.fillna(method="bfill")

          0         1         2         3
0 -0.427703  1.730823 -0.642435 -2.576884
1 -0.257412  1.730823 -0.546373  0.235960
2 -1.720986  1.730823 -0.897181  1.796840
3  0.717568  1.730823 -0.669203 -1.319217
4 -0.820846  1.730823 -0.557223 -1.319217
5 -0.820846  1.730823  0.709728 -1.319217
6 -0.820846 -0.587280  0.132536 -1.319217
7 -0.811715  1.443096  0.883962  0.425833
8  0.058048  0.405307  1.620708       NaN

In [0]:
data1.fillna(method = "ffill" , limit = 2)

          0         1         2         3
0 -0.427703       NaN -0.642435 -2.576884
1 -0.257412       NaN -0.546373  0.235960
2 -1.720986       NaN -0.897181  1.796840
3  0.717568       NaN -0.669203  1.796840
4  0.717568       NaN -0.557223  1.796840
5  0.717568  1.730823  0.709728       NaN
6 -0.820846 -0.587280  0.132536 -1.319217
7 -0.811715  1.443096  0.883962  0.425833
8  0.058048  0.405307  1.620708  0.425833

In [0]:
data1.fillna(data1.mean())

          0         1         2         3
0 -0.427703  0.747987 -0.642435 -2.576884
1 -0.257412  0.747987 -0.546373  0.235960
2 -1.720986  0.747987 -0.897181  1.796840
3  0.717568  0.747987 -0.669203 -0.287494
4 -0.466149  0.747987 -0.557223 -0.287494
5 -0.466149  1.730823  0.709728 -0.287494
6 -0.820846 -0.587280  0.132536 -1.319217
7 -0.811715  1.443096  0.883962  0.425833
8  0.058048  0.405307  1.620708 -0.287494

In [0]:
data1.mean()

0   -0.466149
1    0.747987
2    0.003835
3   -0.287494
dtype: float64

In [0]:
student = pd.DataFrame({"Name":['Ahsan',"Umer","Ali","Taha","Bilal"],\
                        "age":np.random.randint(5,25,size = [5]),
                        "percentage":np.random.randint(50,80,size = [5])})

np.random.seed(5)

In [0]:
student

    Name  age  percentage
0  Ahsan   18          78
1   Umer   24          77
2    Ali   21          79
3   Taha   14          79
4  Bilal   24          72

In [0]:
def name(age):
  if age>18:
    return 'Adult'
  else:
    return "Non-Adult"

In [0]:
student["Status"] = student['age'].map(name)

In [0]:
student

    Name  age  percentage     Status
0  Ahsan   18          78  Non-Adult
1   Umer   24          77      Adult
2    Ali   21          79      Adult
3   Taha   14          79  Non-Adult
4  Bilal   24          72      Adult

In [0]:
def grade(percentage):
  if percentage>=75:
    return 'A'
  elif percentage>=60:
    return "B+"  
  else:
    return "B"

In [0]:
student['Grades']=student['percentage'].apply(grade)

In [0]:
student

    Name  age  percentage     Status Grades
0  Ahsan   18          78  Non-Adult      A
1   Umer   24          77      Adult      A
2    Ali   21          79      Adult      A
3   Taha   14          79  Non-Adult      A
4  Bilal   24          72      Adult     B+

In [0]:
student[student.Status == "Adult"]

    Name  age  percentage Status Grades
1   Umer   24          77  Adult      A
2    Ali   21          79  Adult      A
4  Bilal   24          72  Adult     B+

In [0]:
student[(student.Name.str.startswith('A'))]

    Name  age  percentage     Status Grades
0  Ahsan   18          78  Non-Adult      A
2    Ali   21          79      Adult      A

In [0]:
student[(student.Name.str.endswith('r'))]

   Name  age  percentage Status Grades
1  Umer   24          77  Adult      A

In [0]:
del student["Grades"]

In [0]:
student

    Name  age  percentage     Status
0  Ahsan   18          78  Non-Adult
1   Umer   24          77      Adult
2    Ali   21          79      Adult
3   Taha   14          79  Non-Adult
4  Bilal   24          72      Adult